Revit 2016 API
ReinforcementSettings.DocumentContainsNoRebar Method
 Checks whether the document is free of Rebar elements. Only in this case it is allowed to change RebarShapeDefinesHooks property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method will be obsolete from 2016. Use FilteredElementCollector instead.")]
public bool DocumentContainsNoRebar()
Visual Basic
<ObsoleteAttribute("This method will be obsolete from 2016. Use FilteredElementCollector instead.")> _
Public Function DocumentContainsNoRebar As Boolean
Visual C++
[ObsoleteAttribute(L"This method will be obsolete from 2016. Use FilteredElementCollector instead.")]
public:
bool DocumentContainsNoRebar()
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace